{"keras_version": "1.2.0", "config": [{"config": {"b_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_1", "W_regularizer": null, "input_dtype": "float32", "nb_col": 5, "activation": "relu", "init": "glorot_uniform", "nb_row": 5, "nb_filter": 24, "border_mode": "valid", "batch_input_shape": [null, 66, 200, 3], "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_2", "W_regularizer": null, "nb_col": 5, "activation": "relu", "init": "glorot_uniform", "nb_row": 5, "nb_filter": 36, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_3", "W_regularizer": null, "nb_col": 5, "activation": "linear", "init": "glorot_uniform", "nb_row": 5, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [1, 1], "trainable": true, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_4", "W_regularizer": null, "nb_col": 3, "activation": "relu", "init": "glorot_uniform", "nb_row": 3, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [1, 1], "trainable": true, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_5", "W_regularizer": null, "nb_col": 3, "activation": "linear", "init": "glorot_uniform", "nb_row": 3, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_1", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 1152, "output_dim": 1164, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_2", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 1164, "output_dim": 100, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_3", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 100, "output_dim": 50, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_4", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 50, "output_dim": 10, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_5", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 10, "output_dim": 1, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}